#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>

#define MAX_ITEMS 94

enum {
    TYPE_E = 0,
    TYPE_I,
    TYPE_S,
    TYPE_N,
    TYPE_T,
    TYPE_F,
    TYPE_J,
    TYPE_P,

    MAX_TYPES
};

typedef struct {
    char *question;
    char *answer[3];
    int count[3][3];
    int type[3];
} MBTI_item;

MBTI_item items[] = {
    { //1
        "나는 대체로",
        "다른 사람들과 쉽게 어울리는 사람이다",
        "보다 조용하고 말이 없는 편이다",
        NULL,
        {2, 2, 0, 2, 2, 0},
        TYPE_E, TYPE_I
    },
    { //2
        "만약 자신이 교사라면",
        "실제적인 사실을 다루는 과목들을 가르치고 싶다",
        "이론적인 과목들을 가르치고 싶다",
        NULL,
        {2, 2, 0, 2, 2, 0},
        TYPE_S, TYPE_N
    },
    { //3
        "나는",
        "감정을 이성보다 더 자주 내세우는 편이다",
        "이성을 감정보다 더 자주 내세우는 편이다",
        NULL,
        {1, 1, 0, 2, 2, 0},
        TYPE_F, TYPE_T
    },
    { //4
        "하루 정도 어디를 다녀 오고 싶을 때 나는",
        "언제 무엇을 할 것인가를 계획하는 편이다",
        "별 계획 없이 훌쩍 떠나는 편이다.",
        NULL,
        {2, 2, 0, 2, 2, 0},
        TYPE_J, TYPE_P
    },
    {
        "나는 여러 사람들과 함께 있을 때, 일반적으로",
        "여러 사람들 사이에 끼어 대화를 나누는 편이다",
        "한번에 한사람씩 대화를 나누는 편이다",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_E, TYPE_I
    },
    {
        "자신이 평소에 어떤 형의 사람들과 잘 어울립니까?",
        "상상력이 풍부한 사람",
        "현실 감각이 있는 사람",
        NULL,
        {2, 1, 0, 2, 1, 0},
        TYPE_N, TYPE_S
    },
    {
        "자신은 어떤 것이 더 좋은 칭찬이라고 생각합니까?",
        "솔직하고 감정적인 사람으로 불리우는 것",
        "꾸준하고 합리적인 사람으로 불리우는 것",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_F, TYPE_T
    },
    { //8
        "나는",
        "모임이나 파티 등을 미리 여유있게 계획하는 것을 원하는 편이다",
        "그때 상황에 따라 재미있어 보이는 것을 할 수 있도록 별 계획없이 자유스러운 것을 원하는 편이다",
        NULL,
        {2, 1, 0, 2, 1, 0},
        TYPE_J, TYPE_P
    },
    {
        "나는 사람들이 많은 그룹 내에서",
        "주로 내가 다른 사람을 소개하는 편이다",
        "주로 다른 사람이 나를 소개하는 편이다",
        NULL,
        {2, 2, 0, 2, 2, 0},
        TYPE_E, TYPE_I
    },
    {
        "자신이 어느 쪽으로 인정받기를 더 원하십니까?",
        "실제적이고 현실 감각이 있는 사람",
        "재능과 창의력이 있는 사람",
        NULL,
        {2, 2, 0, 2, 2, 0},
        TYPE_S, TYPE_N
    },
    {
        "자신은 어떤 것이 더 좋은 칭찬이라고 생각합니까?",
        "솔직하고 감정적인 사람으로 불리우는 것",
        "꾸준하고 합리적인 사람으로 불리우는 것",
        NULL,
        {2, 2, 0, 2, 2, 0},
        TYPE_F, TYPE_T
    },
    { //12
        "내가 일을 보다 성공적으로 처리 하는 경우는",
        "기대치않은 일을 다루거나 일을 신속하게 처리해야 할 경우이다",
        "치밀하게 짜여진 계획에 따라 일을 할 경우이다",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_P, TYPE_J
    },
    {
        "나는",
        "소수의 사람들과 깊은 우정을 맺는 편이다",
        "주로 다른 사람이 나를 소개하는 편이다",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_I, TYPE_E
    },
    {
        "자신은 어느 형의 사람을 더 우러러 봅니까?",
        "적당히 보수적이어서 결코 남에게 자신을 드러내지 않는 사람",
        "독창적이고 개성적이어서 자신이 드러나거나 말거나 별로 신경을 쓰지 않는 사람",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_S, TYPE_N
    },
    {
        "자신은 어느 쪽이 더 형편없는 결점이라고 느낍니까?",
        "동정섬이 없는 면",
        "비합리적인 면",
        NULL,
        {1, 0, 0, 2, 0, 0},
        TYPE_F, TYPE_T
    },
    { //16
        "나에게 있어서 짜여진 시간표를 따르는 일은",
        "맘에 든다",
        "답답하게 느껴진다",
        NULL,
        {2, 2, 0, 2, 2, 0},
        TYPE_J, TYPE_P
    },
    {
        "나는 친구들 사이에서",
        "소식이나 소문을 제일 늦게 얻어 듣는 편이다",
        "많은 사람들에 대한 소식이나 소문에 밝은 편이다",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_I, TYPE_E
    },
    {
        "내가 친구로 사귀고 싶은 사람은",
        "언제나 새로운 아이디어를 자아내는 사람",
        "현실 감각이 있는 사람",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_N, TYPE_S
    },
    {
        "자신은 어떤 형의 사람 아래서 일하는 것을 더 좋아합니까?",
        "항상 친절한 사람",
        "언제나 공정한 사람",
        NULL,
        {1, 0, 0, 2, 0, 0},
        TYPE_F, TYPE_T
    },
    { //20
        "주말에 마쳐야 되는 목록을 작성해야 한다는 생각은 나에게 있어서",
        "호감이 간다",
        "별로 마음이 내키지 않는다",
        "생각 하면 우울해진다",
        {1, 1, 1, 1, 1, 1},
        TYPE_J, TYPE_P, TYPE_P
    },
    {
        "내가 대화를 나누어야 한다면",
        "누구하고나 쉽게 얘기를 나누는 편이다",
        "어떤 일정한 사람들이나, 혹은 어떤 상황이 되었을 때 더 쉽게 얘기를 나누는 편이다",
        NULL,
        {2, 2, 0, 2, 2, 0},
        TYPE_E, TYPE_I
    },
    {
        "나는 취미로 독서를 할 때",
        "기묘하거나 독창적인 작가의 표현을 즐기는 편이다",
        "의도한 바를 정확히 표현하는 작가를 좋아하는 편이다",
        NULL,
        {0, 1, 0, 0, 1, 0},
        TYPE_N, TYPE_S
    },
    {
        "자신은 어느 쪽이 더 형편없는 결점이라고 느낍니까?",
        "지나친 온정을 보이는 것",
        "적당한 온정을 보이지 않는 것",
        NULL,
        {1, 0, 0, 1, 0, 0},
        TYPE_T, TYPE_F
    },
    { //24
        "나는 일상생활에서",
        "시간을 다투는 비상상태에서 일하는 것을 즐기는 편이다",
        "시간의 압박을 받으면서 일하는 것을 즐기는 편이다",
        "시간의 압박을 피하기 위하여 대체로 미리 계획을 짜는 편이다",
        {1, 0, 1, 1, 0, 1},
        TYPE_P, TYPE_J, TYPE_J
    },
    {
        "나를 처음 만나는 사람들이 나의 관심이 무엇인가를",
        "만나자마자 바로 아는 편이다",
        "나와 깊이 알고 난 후에야 아는 편이다",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_E, TYPE_I
    },
    {
        "대부분의 사람들이 일상적으로 처리하는 일을 내가 하게될 때",
        "일반적인 관습을 따라 처리하는 것을 더 좋아한다",
        "독창적인 처리방법을 생각해 내는 것을 더 좋아한다",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_S, TYPE_N
    },
    {
        "자신은 어느 쪽에 마음을 더 씁니까?",
        "사람들의 감정을 존중하는 일",
        "사람들의 권리를 보호하는 일",
        NULL,
        {0, 2, 0, 0, 1, 0},
        TYPE_F, TYPE_T
    },
    { //28
        "나는 어떤 특별한 일을 처리할 때",
        "시작하기 전에 미리 조십스럽게 계획을 세우는 편이다",
        "일을 처리해 나가면서 상황에 따라 필요한 대책을 세우는 편이다",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_J, TYPE_P
    },
    {
        "나는 평소에",
        "자신의 감정과 느낌을 자유스럽게 표현하는 편이다",
        "감정과 느낌을 표현하기 보다는 자신 안에 묻어 두는 편이다",
        NULL,
        {1, 0, 0, 1, 0, 0},
        TYPE_E, TYPE_I
    },
    {
        "나의 생활 양식은",
        "독창적인 편이다",
        "관례적인 편이다",
        NULL,
        {0, 1, 0, 0, 1, 0},
        TYPE_N, TYPE_S
    },
    {
        " ",
        "유순한",
        "전고한",
        NULL,
        {1, 2, 0, 0, 2, 0},
        TYPE_F, TYPE_T
    },
    { //32
        "어떤 일을 언제 할 것이라는 계획을 세울 수 있어 좋다고 느끼는 편이다",
        "그것에 맞추어서 다른 계획을 세울 수 있어 좋다고 느끼는 편이다",
        "일정에 메이는 것 때문에 싫은 편이다",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_J, TYPE_P
    },
    {
        "나는 일반적으로 어떤 일에 대하여 다른 사람들 보다",
        "더 열성적인 편이다",
        "덜 열성적인 편이다",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_E, TYPE_I
    },
    {
        "나의 생각에 더 좋은 칭찬이라고 생각하는 것은?",
        "선견지명을 가졌다고 말해주는 것이다",
        "상식이 있는 사람이라고 말해주는 것이다",
        NULL,
        {2, 1, 0, 1, 1, 0},
        TYPE_N, TYPE_S
    },
    {
        " ",
        "생각함",
        "느낌",
        NULL,
        {2, 2, 0, 2, 1, 0},
        TYPE_T, TYPE_F
    },
    { //36
        "나는",
        "그것에 맞추어서 다른 계획을 세울 수 있어 좋다고 느끼는 편이다",
        "일정에 메이는 것 때문에 싫은 편이다",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_P, TYPE_J
    },
    {
        "나는 파티나 회식석상에서",
        "때로 지루하게 느낀다",
        "언제든지 재미있다",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_I, TYPE_E
    },
    {
        "자신은 어느 쪽이 더 중요하다고 봅니까?",
        "어떤 황이 안고 있는 가능성을 보는 일",
        "있는 그대로의 사실에 실체적으로 적응하는 일",
        NULL,
        {0, 1, 0, 0, 1, 0},
        TYPE_N, TYPE_S
    },
    {
        " ",
        "납득시킴",
        "감동시킴",
        NULL,
        {2, 2, 0, 2, 1, 0},
        TYPE_T, TYPE_F
    },
    { //40
        "나는 평상적인 하루의 일과를 알고 있는 것이",
        "일상적인 일을 처리하는데 편리하다고 생각한다",
        "필요하다고는 생각하나 그것을 내일 따르는 것이 고통스럽다",
        NULL,
        {0, 2, 0, 0, 2, 0},
        TYPE_J, TYPE_P
    },
    {
        "나는 일반적으로 새로운 유행이 시작될 때",
        "앞장서서 시도해보는 편이다",
        "별 관심이 없는 편이다",
        NULL,
        {0, 2, 0, 0, 2, 0},
        TYPE_E, TYPE_I
    },
    {
        "나는",
        "선익을 위해서 이미 만들어진 기존 체제 방식을 지지하는 편이다",
        "기존 체제 방식에 무엇이 잘못되어 왔는지를 분석하고 해결되지 않은 문제에 도전하는 편이다",
        NULL,
        {2, 0, 0, 2, 0, 0},
        TYPE_S, TYPE_N
    },
    {
        " ",
        "분석하다",
        "공감하다",
        NULL,
        {1, 2, 0, 2, 2, 0},
        TYPE_T, TYPE_F
    },
    { //44
        "내가 처리해야 될 사소한 일이나 구입할 물건이 생각에 떠올랐을 때",
        "자주 잊고 있다가 나중에야 기억하는 편이다",
        "기억하기 위해서 메모지에 적어두는 편이다",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_P, TYPE_J, TYPE_J
    },
    {
        "나는",
        "다른 사람들이 쉽게 사귈 수 있는 편이다",
        "다른 사람들이 쉽게 사귈 수 있는 편이 아니다",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_E, TYPE_I
    },
    {
        " ",
        "현실",
        "이념",
        NULL,
        {2, 1, 0, 2, 1, 0},
        TYPE_S, TYPE_N
    },
    {
        " ",
        "정의",
        "자비",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_T, TYPE_F
    },
    { //48
        "나에게 적응하기 더 어려운 일은",
        "틀에 박힌 일상적인 일과",
        "계속적인 변화",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_P, TYPE_J
    },
    { //49
        "나는 대화 도중에 당혹한 상황에 처했을 때",
        "대화의 주제를 바꾼다",
        "농담으로 돌린다",
        "며칠 후에야 그때 무슨 얘기를 했어야 되었다고 생각한다",
        {0, 1, 2, 0, 1, 2},
        TYPE_I, TYPE_E, TYPE_I
    },
    { //50
        " ",
        "사실적인 진술",
        "추상적인 개념",
        NULL,
        {2, 1, 0, 2, 1, 0},
        TYPE_S, TYPE_N
    },
    { //51
        " ",
        "측은지심",
        "선견지명",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_F, TYPE_T
    },
    { //52
        "일주일안에 마무리 지어야 할 큰 일을 시작할 때",
        "시간을 내어 일의 목록을 작성하고 그 처리 순서를 정한다",
        "그냥 뛰어들어 시작한다",
        NULL,
        {2, 1, 0, 2, 1, 0},
        TYPE_J, TYPE_P
    },
    {
        "나를 가까이 아는 사람들은",
        "대부분의 일에 있어서 내가 어떻게 느끼는 가를 아는 편이다",
        "내가 어떻게 느끼는 가를 설명했을 때만 아는 편이다",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_E, TYPE_I
    },
    {
        " ",
        "이론",
        "확신",
        NULL,
        {2, 1, 0, 2, 1, 0},
        TYPE_N, TYPE_S
    },
    {
        " ",
        "혜택",
        "축복",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_T, TYPE_F
    },
    { //56
        "나는 일을 처리하는 데 있어서",
        "미리 시작해서 여유있게 마무리 하는 편이다",
        "막바지에 가서 서둘러 끝내는 편이다",
        NULL,
        {0, 1, 0, 0, 1, 0},
        TYPE_J, TYPE_P
    },
    {
        "나는 파티나 회식 석상에서?",
        "파티가 진행되도록 돕는 일을 좋아 한다",
        "사람들이 자기 나름대로 즐기도록 놓아두는 일을 좋아한다",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_E, TYPE_I
    },
    {
        " ",
        "문자 그대로",
        "비유적으로",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_S, TYPE_N
    },
    {
        " ",
        "결심",
        "헌신",
        NULL,
        {1, 1, 0, 1, 2, 0},
        TYPE_T, TYPE_F
    },
    { //60
        "내가 만약 어느 일요일 아침에 그날 무엇을 할 것이냐고 질문을 받았다면 그 순간에",
        "무엇을 할것인가를 술술 얘기해 줄 수 있을 것이다",
        "실제 할 수 있는 일보다 거의 두배나 될 정도의 계획을 나열할 것이다",
        "기다렸다가 그날 지나보아야 무엇을 할지 알 수 있다고 말할 것이다",
        {0, 1, 1, 0, 1, 1},
        TYPE_J, TYPE_P, TYPE_P
    },
    {
        " ",
        "기운찬",
        "차분한",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_E, TYPE_I
    },
    {
        " ",
        "상상적인",
        "사실적인",
        NULL,
        {0, 2, 0, 0, 2, 0},
        TYPE_N, TYPE_S
    },
    {
        " ",
        "굳건한 의지",
        "따뜻한 마음",
        NULL,
        {2, 0, 0, 2, 0, 0},
        TYPE_T, TYPE_F
    },
    { //64
        "나에게 있어서 틀에 박힌 일상적인 일은",
        "쉽고 편안하다",
        "지루하다",
        NULL,
        {1, 0, 0, 1, 0, 0},
        TYPE_J, TYPE_P
    },
    {
        " ",
        "말이 별로 없음",
        "말로 쉽게 표현함",
        NULL,
        {1, 0, 0, 1, 0, 0},
        TYPE_I, TYPE_E
    },
    {
        " ",
        "제작하다",
        "창작하다",
        NULL,
        {2, 0, 0, 2, 0, 0},
        TYPE_S, TYPE_N
    },
    {
        " ",
        "중재자",
        "심판관",
        NULL,
        {0, 2, 0, 0, 2, 0},
        TYPE_F, TYPE_T
    },
    { //68
        " ",
        "계획",
        "무계획",
        NULL,
        {2, 2, 0, 2, 2, 0},
        TYPE_J, TYPE_P,
    },
    {
        " ",
        "침착한",
        "발랄한",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_I, TYPE_E
    },
    {
        " ",
        "재치있는",
        "흥미있는",
        NULL,
        {2, 0, 0, 2, 0, 0},
        TYPE_S, TYPE_N
    },
    {
        " ",
        "부드러움",
        "강함",
        NULL,
        {0, 2, 0, 0, 2, 0},
        TYPE_F, TYPE_T
    },
    { //72
        " ",
        "체계적",
        "자발적",
        NULL,
        {2, 2, 0, 2, 2, 0},
        TYPE_J, TYPE_P
    },
    {
        " ",
        "말하기",
        "쓰기",
        NULL,
        {0, 1, 0, 0, 1, 0},
        TYPE_E, TYPE_I
    },
    {
        " ",
        "제작",
        "설계",
        NULL,
        {1, 0, 0, 1, 0, 0},
        TYPE_S, TYPE_N
    },
    {
        " ",
        "용서하다",
        "참아주다",
        NULL,
        {0, 2, 0, 0, 2, 0},
        TYPE_F, TYPE_T
    },
    { //76
        " ",
        "계획에 따른",
        "상황에 따른",
        NULL,
        {2, 2, 0, 2, 2, 0},
        TYPE_J, TYPE_P,
    },
    {
        " ",
        "사교적",
        "초연적",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_E, TYPE_I
    },
    {
        " ",
        "구체적인",
        "추상적인",
        NULL,
        {1, 2, 0, 1, 2, 0},
        TYPE_S, TYPE_N
    },
    {
        " ",
        "누구를",
        "무엇을",
        NULL,
        {0, 1, 0, 0, 1, 0},
        TYPE_F, TYPE_T
    },
    { //80
        " ",
        "충동",
        "계획",
        NULL,
        {2, 1, 0, 2, 1, 0},
        TYPE_P, TYPE_J
    },
    {
        " ",
        "파티",
        "독서",
        NULL,
        {1, 0, 0, 1, 0, 0},
        TYPE_E, TYPE_I
    },
    {
        " ",
        "건설하다",
        "발명하다",
        NULL,
        {2, 1, 0, 2, 1, 0},
        TYPE_S, TYPE_N
    },
    {
        " ",
        "무비판적인",
        "비판적인",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_F, TYPE_T
    },
    { //84
        " ",
        "시간적으로 정확한",
        "유유자적한",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_J, TYPE_P
    },
    {
        " ",
        "초석",
        "귀감",
        NULL,
        {0, 2, 0, 0, 2, 0},
        TYPE_S, TYPE_N
    },
    {
        " ",
        "조심스러이 대하는",
        "허물없이 대하는",
        NULL,
        {2, 0, 0, 2, 0, 0},
        TYPE_T, TYPE_F
    },
    {
        " ",
        "변화하는",
        "영구적인",
        NULL,
        {0, 1, 0, 0, 1, 0},
        TYPE_P, TYPE_J
    },
    { //88
        " ",
        "이론",
        "경험",
        NULL,
        {2, 0, 0, 2, 0, 0},
        TYPE_N, TYPE_S
    },
    {
        " ",
        "동의하다",
        "토론하다",
        NULL,
        {0, 0, 0, 1, 0, 0},
        TYPE_F, TYPE_T
    },
    {
        " ",
        "규칙적인",
        "느긋한",
        NULL,
        {2, 1, 0, 2, 1, 0},
        TYPE_J, TYPE_P
    },
    {
        " ",
        "표식",
        "상징",
        NULL,
        {1, 0, 0, 1, 0, 0},
        TYPE_S, TYPE_N
    },
    { //92
        " ",
        "신속한",
        "신중한",
        NULL,
        {1, 0, 0, 1, 0, 0},
        TYPE_P, TYPE_J
    },
    {
        " ",
        "수용하다",
        "변경하다",
        NULL,
        {1, 0, 0, 1, 0, 0},
        TYPE_S, TYPE_N
    },
    {
        " ",
        "알려진",
        "미지의",
        NULL,
        {1, 1, 0, 1, 1, 0},
        TYPE_S, TYPE_N
    }
};

int getAnswer(char *msg, int N)
{
    char str[256];
    int answer;

    do {
        printf("%s", msg);
        gets(str);

        answer = toupper(str[0]) - 'A';
    } while (answer < 0 || answer >= N || strlen(str) > 1);

    return answer;
}

int main()
{
    int gender;
    char answer[MAX_ITEMS] = {0,};
    char type[5] = {0};
    int type_count[MAX_TYPES] = {0,};
    char buf[256];

    gender = getAnswer("Input your gender (A:Male B:Female): ", 2);

    for (int i = 0; i < sizeof(items) / sizeof(MBTI_item); i++) {
        int N = 0;
        printf("\n%d. %s\n", i+1, items[i].question);
        for (int j = 0; j < 3; j++, N++) {
            if (items[i].answer[j] == NULL) break;
            printf(" (%c). %s.\n", j+'A', items[i].answer[j]);
        }

        answer[i] = getAnswer("Answer: ", N);
    }

    printf("\n");
    for (int i = 0; i < sizeof(items) / sizeof(MBTI_item); i++) {
        int idx = answer[i];
//printf("%d> %d %d\n", i, idx, items[i].type[idx]);
        type_count[items[i].type[idx]] += items[i].count[gender][idx];
    }

    /*for (int i = 0; i < MAX_TYPES; i++) {
        printf("%d %d\n", i, type_count[i]);
    }*/

    type[0] = (type_count[TYPE_E] >= type_count[TYPE_I]) ? 'E' : 'I';
    type[1] = (type_count[TYPE_S] >= type_count[TYPE_N]) ? 'S' : 'N';
    type[2] = (type_count[TYPE_T] >= type_count[TYPE_F]) ? 'T' : 'F';
    type[3] = (type_count[TYPE_J] >= type_count[TYPE_P]) ? 'J' : 'P';
    printf("Your type is %s.\n", type);

    char fname[128];
    sprintf(fname, "data/%s.txt", type);
    FILE *fp = fopen(fname, "r");
    if (!fp) {
        printf("ERROR: can't open data '%s'.\n", fname);
        return -1;
    }

    while (fgets(buf, sizeof(buf), fp)) {
        printf("%s", buf);
    }
    fclose(fp);

    return 0;
}
